Revit 2027 API
FormattedText.GetMaximumIndentLevel Method
 Returns the maximum allowed indent level
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetMaximumIndentLevel()
Public Function GetMaximumIndentLevel As Integer
public:
int GetMaximumIndentLevel()
member GetMaximumIndentLevel : unit -> int
Return Value
Int32
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace